{"text":"<human> I want to write about Competency: Diversity, inclusion and teamworking\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Diversity, inclusion and teamworking competency is 1.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience: I worked on projects where Mott MacDonald undertook a design role and other projects where Mott MacDonald undertook only the Quantity Surveying role. From these mixed experiences, I learned the anticipated role of every team member and the prominence of collaborative work practice.  I worked on various projects with Mott MacDonald offices all over the UK. Regular meetings and record taking were keys to effective communication and contribute positively towards early recognition of potential issues and solving them.  I have built smaller teams for quantity take-off for various projects where I reviewed the measured quantities, compiled them in the Mott MacDonald format for cost plans, and met project deadlines.\n"}
{"text":"<human> I want to write about Competency: Ethics, rules of conduct and professionalism\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Ethics, rules of conduct and professionalism competency is 3.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience: By studying different RICS guidance notes, I am aware of the five principles of ethical and professional standards as well as the nine rules for people and fifteen rules for firms. These principles and rules provided the base for my professional role as a Quantity Surveyor. The guidance notes provided me with a better understanding of the required complaint handling procedures to be adopted in firms and the importance of continuous professional development. I am aware of the importance of the application of the RICS ethical and professional standards to match society's expectations and secure clients. These ethical standards aim at the reassurance of fair treatment and respect to all stakeholders.\n"}
{"text":"<human> I want to write about Competency: Ethics, rules of conduct and professionalism\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Ethics, rules of conduct and professionalism competency is 3.\n<human> Okay, you could help me with level 2.\n<bot> Sure, here is a proposed response: Level: 2  Summary of Experience: Throughout the Royal Wharf Primary School Project, I achieved a high level of service for the client by taking responsibility for my actions. I noticed a typing error in the invoice number of a valuation certificate. I informed the project manager and rectified this error, then circulated the corrected certificate to the contractor. In the City of London Freemen's School project, I acted in a way that promotes trust in the profession when drafting additional fee letters for the extended period of service. I provided the fee breakdown showing Human Resources required, number of hours, and the hourly rate. I stated transparently overheads and profit percentage in the calculation breakdown.\n"}
{"text":"<human> I want to write about Competency: Ethics, rules of conduct and professionalism\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Ethics, rules of conduct and professionalism competency is 3.\n<human> Okay, you could help me with level 3.\n<bot> Sure, here is a proposed response: Level: 3  Summary of Experience:  In the Royal Wharf Primary School project, I reviewed a contractor's application for payment where I discovered that they undervalued the brickworks. I informed the contractor of this error and valued the works as seen on site. I advised the client of the importance of valuing the works based on their actual progress on-site to avoid adverse implications on the contractor's cash flow. I always respect the client's confidentiality and act with integrity. In the City of London Freemen's School project, I held monthly risk workshops between the Client, the Design Team, and the Contractor. The Contractor contacted me several times to know the actual risk monies in the register. I advised that it was not my place to respond and respected the confidentiality of the client's information.\n"}
{"text":"<human> I want to write about Competency: Health and safety\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Health and safety competency is 2.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience: I undertook training courses including site safety awareness which highlighted different hazards that anyone might face on-site and how to deal with them. Having completed these courses, I am aware of the different levels of PPE that should be used on-site depending on the works (3-point, 5-point, or more).  for I am aware of the differences between CDM regulations 2007 and 2015. I understand the different types of CSCS cards. I am aware of the RICS guidance for Health and Safety for Residential Property Managers.\n"}
{"text":"<human> I want to write about Competency: Health and safety\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Health and safety competency is 2.\n<human> Okay, you could help me with level 2.\n<bot> Sure, here is a proposed response: Level: 2  Summary of Experience: While undertaking a valuation for Enfield Small Sites Phase 2 project, a painter was not wearing goggles and the paint gun burst in his face thus covering his eyelashes and eyebrows with paint. I notified the site manager and filed a Mott MacDonald positive intervention form for formal records. In the Royal Wharf Primary School project, I saw that formwork panels were lifted from 2 lugs. Working before as a method engineer, I used to design three lifting points for heavy formwork panels. I questioned the safety with the site manager and sent another lifting proposal to the contractor design manager.\n"}
{"text":"<human> I want to write about Competency: Inclusive environments\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Inclusive environments competency is 1.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience: I understand the importance of having an inclusive design for places to be accessible for all. This promotes the participation of all in everyday activities and removes any potential barriers. I understand that the process of management of inclusive environments and what is required. I am aware that the Construction Industry Council (CIC) drafted an action plan and continued to extend its scope to cover the aforementioned pillars. Mott MacDonald promote Equality, Diversity, and Inclusion by adhering to fair employment procedures and practices ensuring equal opportunities for all.\n"}
{"text":"<human> I want to write about Competency: Accounting principles and procedures\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Accounting principles and procedures competency is 1.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience: From my studies at Heriot-Watt University, I am aware of the basic accounting principles including balance sheets profit and loss account. I am aware of the differences between management and financial accounts. I managed our accounting software \"Connect Business\" where I managed the budget and invoicing of various projects.\n"}
{"text":"<human> I want to write about Competency: Business planning\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Business planning competency is 1.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience:  At Mott MacDonald, I attended quarterly meetings where senior staff members shared the business plans and showed the longterm and short-term goals and how Mott MacDonald was targeting to achieve them.  I was involved in tracking resources' utilisation required for Enfield Council Exeter Road project that affected the anticipated profit margin and the budgeting. I also attended weekly catch-up meetings with my delivery team to discuss the capacity and utilisation of every QS and PM.\n"}
{"text":"<human> I want to write about Competency: Client care\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Client care competency is 2.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience: I have worked on various projects with Enfield Council, where I attended formal monthly progress meetings and informal biweekly site walkarounds to ensure that the client's requirements were satisfied. I was also in contact with the client via emails to answer any queries and make sure that a high standard of delivery was provided. I am also aware of the procedures that Mott MacDonald have in place when a client raises a complaint.\n"}
{"text":"<human> I want to write about Competency: Client care\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Client care competency is 2.\n<human> Okay, you could help me with level 2.\n<bot> Sure, here is a proposed response: Level: 2  Summary of Experience: In the City of London Freemen's School Project, upon the request of the Client, I drafted a risk management tool that monitored the expenditure of variations against the Risk items listed in NRM1. I provided the client with monthly updates about the risk monies remaining. This allowed the client to have a firmer view of the project. In order to provide more value to the client, I changed the risk management tool format to match the client's reporting format and incorporated some sections of their progress report into ours.  I prepared a workshop for Highways England to understand the correlation between mental health and wellbeing on Health and Safety in Construction. I engaged with the client representatives in an open questionnaire and correlated their responses in a report circulated after the meeting.\n"}
{"text":"<human> I want to write about Competency: Communication and negotiation\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Communication and negotiation competency is 2.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience: I understood from my previous studies the importance of clear and concise means of communication (oral or written) and the prominence of mastering negotiation skills. This was enhanced further by working on various projects and reading various guidance notes of the RICS. RICS guidance notes allowed me to understand the importance of acting correctly on internal and external communications.\n"}
{"text":"<human> I want to write about Competency: Communication and negotiation\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Communication and negotiation competency is 2.\n<human> Okay, you could help me with level 2.\n<bot> Sure, here is a proposed response: Level: 2  Summary of Experience: In the City of London Freemen's School Project, I undertook monthly site visits and biweekly commercial meetings with the contractor to discuss variation orders and to agree on valuations. I held monthly progress meetings with the Design Team, the Client, and the Main Contractor to discuss and close the ongoing issues in the Key Actions tracker. In the Royal Wharf Primary School project, I reviewed thirty-three change orders arisen from lack of design coordination totalling circa £600k. I negotiated the rates with the contractor based on quotes obtained from the supply chain and previous projects. I managed to save the client circa £80k.\n"}
{"text":"<human> I want to write about Competency: Conflict avoidance, management and dispute resolution procedures\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Conflict avoidance, management and dispute resolution procedures competency is 1.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience: I understand that conflicts are inevitable in construction projects and that clauses in the contract have to regulate the conflict resolution process either by adjudication, arbitration, or litigation. I understand that these clauses are effective when amicable means of dealing with conflicts such as negotiation, conciliation, or mediation are rendered ineffective. In the projects I worked on, I tried to promote amicable means of settling disputes since the early stages of the projects to make sure that they were the most preferable option when conflicts arise.\n"}
{"text":"<human> I want to write about Competency: Data management\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Data management competency is 1.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience: I am aware of the General Data Protection Regulation (GDPR) which presents a general data protection regime for UK businesses. I understand that the GDPR follows the Data Protection Act 2018. I am also aware of the different data sources for pricing such as the Building Cost Information Service (BCIS), in-house data, price books, and historical projects. In Mott MacDonald, I used SharePoint to store information related to different projects and give external access to clients when required while following Mott MacDonald group policies for data sharing.\n"}
{"text":"<human> I want to write about Competency: Sustainability\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Sustainability competency is 1.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience: The basic knowledge about sustainability and its three pillars was covered during my studies at Heriot-Watt University. I understand how construction practices were incorporated to fulfil the needs of current generations without jeopardising the needs of future generations. I am aware of different environmental assessment methods such as BREEAM and SKA and the main areas covered by the BREEAM as well as its ratings. The projects that I worked on had to meet BREEAM requirements and achieve certain sustainability targets. A key document that projects had to adhere to was the Site Waste Management Plan which was modified according to the projects' value.\n"}
{"text":"<human> I want to write about Competency: Contract practice\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Contract practice competency is 3.\n<human> Okay, you could help me with level 2.\n<bot> Sure, here is a proposed response: Level: 2  Summary of Experience: During my employment at Mott MacDonald, I have gained more experience in the compilation of JCT contract documentation. I have prepared contract documents for JCT SBC XQ for both the City of London Freemen's School Main House Refurbishment Project and the London Borough of Enfield (LBE) Exeter Road project. This included Form of Tender, Invitation to Tender, Contract Sum Analysis, Preliminaries, Drawings, Specifications, Relevant correspondence, and Tender Addenda. I liaised with LBE to make sure that the required addenda are forwarded and reviewed before inserting them in the contract documentation. I have managed to collate all appendices collected from different parties and made sure the correct revisions are used. I made sure that all parties are agreeing to the contract documentation before liaising with the legal team and executing the contract. I carried out monthly valuations for the City of London Freemen's School Main House project in accordance with the agreed contract form and the valuation schedule (as stated in the Contract Particulars). I have also issued certificates following the periodic payment method of valuing works.\n"}
{"text":"<human> I want to write about Competency: Contract practice\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Contract practice competency is 3.\n<human> Okay, you could help me with level 3.\n<bot> Sure, here is a proposed response: Level: 3  Summary of Experience: In the Royal Wharf Primary School Project, I have reviewed the costs concerning a loss and expense claim following a relevant matter under the contract. After reviewing the cost breakdown of the claim and after undertaking a site visit in the prolonged period, I have advised the client that the contractor is claiming preliminaries that were not in line with the agreed contract and that the claimed costs for scaffolding accounted for areas that would not be affected by the prolonged period. I have also advised the client that further substantiation is required from the contractor for the testing and commissioning claimed monies in the affected areas over the prolonged period. In the City of London Freemen's School Main House Refurbishment Project, the client was keen to adopt a collaborative approach with the contractor and was exploring the option of an advance payment for long lead-in materials. I had to draft a technical note to the Client highlighting the pros and cons anticipated. I advised the client on the importance of securing an Advance Payment Bond if they are to proceed with the advance payment option.\n"}
{"text":"<human> I want to write about Competency: Design economics and cost planning\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Design economics and cost planning competency is 3.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience: During University, I studied two modules about cost planning, indices, and life cycle costing. These modules highlighted the different RIBA stages as well as the cost data and design information that is required to be available within each stage. I have enhanced my knowledge by reviewing the RICS's New Rules of Measurement 1 and 2. I understand the different types of cost information required to be used in cost estimates, including price books, in-house database, BCIS, or previous projects in order to enhance the accuracy. I am aware of the importance of having reliable cost data as this is vital in design development and possibly value engineering options which might contribute by increasing or decreasing the project's contract sum.\n"}
{"text":"<human> I want to write about Competency: Design economics and cost planning\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Design economics and cost planning competency is 3.\n<human> Okay, you could help me with level 2.\n<bot> Sure, here is a proposed response: Level: 2  Summary of Experience: On Exeter Road Residential Project, I drafted an order of cost estimate for RIBA Stage 2 (Conceptual Design). The design team provided three options for the residential blocks. I had to create three cost models with a summary page comparing the overall cost of all models. This was required to provide the client with an understanding of the anticipated budget and different design options which could be adopted. I created a dashboard presenting the unit split among the three options as well as the efficiency in utilisation of the floor area within each block. I worked on a project for Brighton and Hove Council to develop Hangleton Lane between A293 and Hangleton Valley Drive. The scope of works extended to new raised tables, kerbs, tarmac, tactile paving, and 2 bus shelters. I measured the required work items using CostX software. I used two sources of pricing for this project; price books (SPON's 2019) and the in-house pricing database.\n"}
{"text":"<human> I want to write about Competency: Design economics and cost planning\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Design economics and cost planning competency is 3.\n<human> Okay, you could help me with level 3.\n<bot> Sure, here is a proposed response: Level: 3  Summary of Experience: In the Northcote project, following the issue of the RIBA stage 3 cost plan, the client requested to have a value engineering workshop as the project budget was not feasible for the council. I participated in several value engineering workshops with the design team and the client. After liaising with the design team there was a list of items that I have highlighted based on the pricing of the cost plan: timber balconies, large-sized curtain walls, aluminium doors, glass bricks, zinc cladding and Woodpecker flooring. I compiled a list including these items alongside some potential alternatives I advised the client about including internal wooden doors, brick slips and concrete balconies. I calculated the potential saving that might be realised if these options were accounted for. This resulted in maintaining the feasibility of the scheme.  Throughout the City of London Freemen's School Main House project, I received several change orders from the contractor concerning the changes required to the lighting of the project. I held several design workshops with the MEP engineer to discuss the necessity of the proposed changes and if a scope alteration is really required. I challenged the contractor on multiple occasions while having the reasoning behind rejecting the change orders (including the change in the lighting brand, number of external lights for bollards and external LEDs for pathway). I advised the client on the rejection of 9 change orders totalling circa £143k.\n"}
{"text":"<human> I want to write about Competency: Construction technology and environmental services\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Construction technology and environmental services competency is 3.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience: Having a civil engineering background and during my studies at Heriot-Watt University, I was made aware of the importance of the RIBA Plan of Works during different stages of the project. I am aware of the recent changes of the RIBA PoW for stage 3 to account for the spatial coordination and Stage 5 to account for the manufacturing. I had the chance to work on infrastructure, housing and education projects. Through all that, I was able to develop a solid understanding of the different elements of buildings as well as different methods of construction which are applied in projects depending on their nature. I also understand the different types of frames (concrete vs steel) as well as the approach towards Modern Methods of Construction.\n"}
{"text":"<human> I want to write about Competency: Construction technology and environmental services\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Construction technology and environmental services competency is 3.\n<human> Okay, you could help me with level 2.\n<bot> Sure, here is a proposed response: Level: 2  Summary of Experience: In the City of London Freemen's School Main House Refurbishment project, the tender submission was over budget, and I was involved in several value engineering workshops. Some packages were revisited such as stoneworks, windows repairs (on-site with reduced costs in an uncontrolled environment with zero delivery costs vs. off-site with elevated costs in a controlled environment and substantial delivery costs), and glass roof (change in material from the trafficable roof to non-trafficable roof). I priced the alternatives for these packages This pricing exercise allowed bringing the tender submission within the +10% margin which I have advised the client prior.  In the Royal Wharf Primary School Project, the client wanted to know the life cycle impact of using the materials' specification designed. I had to use the BREEAM New Construction 2014 form. I filled in the required information (areas & specification clause) about the various elements of the following sections of the form: internal walls, external walls, windows, roof, upper floor slab, and floor finishes. I then submitted the form to the assessor to use the data for the BREEAM Mat 01 calculator and determine the number of credits that this may be awarded.\n"}
{"text":"<human> I want to write about Competency: Construction technology and environmental services\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Construction technology and environmental services competency is 3.\n<human> Okay, you could help me with level 3.\n<bot> Sure, here is a proposed response: Level: 3  Summary of Experience: In the Royal Wharf Primary School project, the design team requested the commercial implications of using pad footings vs raft slab and also the usage of blockwork for a part of the building vs Steel Frame System (SFS). I have priced the different alternatives based on the drawings and sketches provided and shared my findings with the design team and the client. I advised the client to use blockwork to ensure the integrity of the whole building fabric and to avoid any unexpected lead times for the SFS. In Exeter Road Project, the client required an order of cost estimate based on RIBA Stage 2 Drawings for the landscaping works required for the project. I priced the order of cost estimate based on the latest Design Team Drawings. The design proposed two options; either using SUDS and attenuation tanks or run-off to the wetlands. I priced both options and advised the client to proceed with the run-off through wetlands as this option saved circa £420k and fulfilled the drainage requirements provided by the Civil Engineer.\n"}
{"text":"<human> I want to write about Competency: Procurement and tendering\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Procurement and tendering competency is 3.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience: During my undergraduate and postgraduate studies, I gained basic knowledge about the principles of procurement and tendering.  This knowledge was boosted by working on various projects during my time at Mott MacDonald as well as attending CPD sessions. I am aware of the advantages and disadvantages of using the Traditional procurement route and the Design and Build procurement route. I had the chance to develop basic knowledge about Management Contracting and Construction Management routes. I understand that the client's objectives steer the project towards the right procurement route for the project. I am also aware of the Single-Stage and Two-Stage tendering techniques. This affects the tender review exercise. I am also aware of the tender documents required to be compiled and the basic titles expected to be presented in the tender report.\n"}
{"text":"<human> I want to write about Competency: Procurement and tendering\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Procurement and tendering competency is 3.\n<human> Okay, you could help me with level 2.\n<bot> Sure, here is a proposed response: Level: 2  Summary of Experience: In the City of London Freemen's School Main House Refurbishment Project, a Two-Stage Traditional procurement route was used for this project. I carried out a tender review for the successful contractor against our cost plan. There were 90 work packages submitted. I carried out the scrutiny of quantities and rates over a period of 30 days and liaised with the contractor for extra substantiation required. Following the tender review, I compiled a list of packages (stone works, window repairs, glazed trafficable roof, and the glass lift). Cost reduction opportunities could possibly be implemented through value engineering workshops. I participated in value engineering workshops where the client's definition for value was further clarified and the project team managed to change the materials and the construction methods required for the aforementioned packages. After submitting the new price for the packages in question, I compiled a tender report which included all the packages received from the contractor alongside the cost plan allowance and the amount of saving realised.\n"}
{"text":"<human> I want to write about Competency: Procurement and tendering\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Procurement and tendering competency is 3.\n<human> Okay, you could help me with level 3.\n<bot> Sure, here is a proposed response: Level: 3  Summary of Experience: In the Exeter Road Residential project for LBE, I discussed with the council the time, cost, and quality constraints surrounding the project. The time and cost constraints were the governing factors. That was why I advised the client on using a Single-Stage Design and Build procurement route. A contractor was procured at an early stage and the project started with the necessary design aspects. The outstanding design portions progressed as the project proceeded.  There was a quality risk, but it was accounted for in the risk register. I also advised the client to retain the current design team as the technical advisors to make sure that the contractor's design is in line with the Employer's Requirements (ERs). This helped decrease the quality risks on the client's side.  In the Northcote Project for the London Borough of Wandsworth, I reviewed the project requirements for cost, time, and quality with the council. The council emphasised the importance of cost and time. I advised the council on using a Single-Stage Design and Build procurement route which enables the early involvement of the successful contractor. We had a long-standing relationship with the council and Mott MacDonald had the chance to be the engineering team developing the ERs. Upon the receipt of the tenders, I discovered that one of the two tenderers based their price on a steel frame in lieu of the concrete frame stated in the ERs. This increased the cost of the substructure, superstructure, and upper floors dramatically leading to an imbalance between the tenders. I contacted that tenderer to confirm that they did not follow the ERs, and they confirmed that they were comfortable with their design. I compiled a tender report highlighting the allowances that I measured in the cost plan and the tenders from the two contractors. I notified the client in the tender report about the difference in cost between the two contractors in the substructure, superstructure, and upper floors. I advised the client to proceed with the contractor who followed the ERs as they provided the better quality and the most economically advantageous tender when compared to the other contractor.\n"}
{"text":"<human> I want to write about Competency: Project finance\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Project finance competency is 3.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience: My studies allowed me to gain knowledge about the importance of establishing change control procedures and how change orders could affect the project cash flow and contingency. I have learned that all costs should be reported against the budget. I have also gained knowledge about the different items that should be included within the valuation of works such as measured works, provisional sums, and material on/off-site. I have also understood from attending different design team meetings how value engineering alternatives could allow costs to be within budget. Working on different projects allowed me to understand the importance of financial reporting on a regular basis to make sure that the client is aware of the potential changes in budget and manages to get the project within the set budget. One of the main tools within the cost report which could help the client is the anticipated cash flow.\n"}
{"text":"<human> I want to write about Competency: Project finance\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Project finance competency is 3.\n<human> Okay, you could help me with level 2.\n<bot> Sure, here is a proposed response: Level: 2  Summary of Experience: In the City of London Freemen's School Main House Refurbishment project, throughout the early works contract and the main works contract, I carried out valuations on-site and this raised my awareness of the Change Orders that would be raised by the contractor. I drafted cost reports to reflect the cost movement between the current and the previous reporting period as well as the change orders within this reporting period and the impact on the risk amount allocated to the project. In the Small Sites Phase 2 project for the LBE, I undertook a final account meeting with the contractor where I agreed with him on the outstanding change orders and the loss and expense claim.  I drafted the final account statement to be signed by both parties (Client and Contractor) after the issue of the certificate of Practical Completion.\n"}
{"text":"<human> I want to write about Competency: Project finance\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Project finance competency is 3.\n<human> Okay, you could help me with level 3.\n<bot> Sure, here is a proposed response: Level: 3  Summary of Experience: In the City of London Freemen's School Main House Refurbishment project, after a number of progress meetings, I enhanced my understanding of the client requirements and drafted a customized cost report reflecting not only the conventional sections (variations, instructions, cash flow, provisional sums & cashflow), but also the invoicing of fees for all consultants. Also, as per the client requirements, I had to add a section in the cost report to outline the Risk Items priced in accordance with NRM1 and the amount of contingency monies remaining following the instruction of approved variations. I added another appendix outlining the declining risk cash flow as the project progresses. In this section, I advised the client on a monthly basis on the amount of risk monies that could be released back to the City of London equating to the difference between the estimated risk monies at the time of forming the contract and the total expenditure of change orders to date.  In the Small Sites Phase 2 project for the London Borough of Enfield, I created a bespoke appendix to the cost report following the client request to group the change orders. To enable this, I created funding pots to allocate change orders accordingly. This enabled me to advise the client on the expenditure required for the different pots within the council.\n"}
{"text":"<human> I want to write about Competency: Quantification and costing\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Quantification and costing competency is 3.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience: During my university courses, I had read and understood the New Rules of Measurement documents (NRM1,2&3). I now understand how methods of measurements are adopted at different RIBA stages and that pricing documents have to follow these standards methods of measurements to be easily understood by the project team.  I have gained experience on how to price different building elements at different RIBA stages depending on the level of design development. During my time at Mott MacDonald, I have applied the NRM in different order of cost estimates and cost plans during different RIBA Stages.\n"}
{"text":"<human> I want to write about Competency: Quantification and costing\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Quantification and costing competency is 3.\n<human> Okay, you could help me with level 2.\n<bot> Sure, here is a proposed response: Level: 2  Summary of Experience: In the City of London Freemen's School Main House project, following on-site surveys during the construction phase, the contractor discovered water leakage in various places in the east and the west wing. The water leakage led to visible cracks in a multitude of plaster areas and rotting of wood joists and beams. The total of the change order was circa £513k for both wings. I measured the quantities of both wings and challenged the contractor following the design team's comments. I attended a workshop with the contractor to discuss the rates claimed and following a benchmarking exercise I managed to reduce the cost of the claim to circa £380k which saved the client around 25% of the claimed value. In Exeter Road Phase 1 project, following planning changes, the Design Team had to change the layout of one of the blocks delivered in the scheme and had produced three design options. I had to provide the Client with three order of cost estimates. I used Mott MacDonald benchmarking database for the pricing as well as the BCIS and BOQs from previous projects.\n"}
{"text":"<human> I want to write about Competency: Quantification and costing\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Quantification and costing competency is 3.\n<human> Okay, you could help me with level 3.\n<bot> Sure, here is a proposed response: Level: 3  Summary of Experience: In the City of London Freemen's School Main House Refurbishment project, I participated in the preparation of a stage 4 cost plan for a grade II listed building using NRM 2. The cost plan had to be very detailed to provide a higher level of cost certainty. The nature of works required to be measured included stone, windows, and floor repairs as well as major and minor demolitions. I have measured the MEP package and reviewed all packages with a Senior Quantity Surveyor. For the pricing part, I used prices from suppliers and previous cost plans. For inflation, I used the tender price index from the Building Cost Information Service (BCIS) to establish the uplift for construction cost. Floor and MEP surveys were old, so I had to include provisional sums to account for unforeseen events. I used old projects of a similar nature to be able to estimate the amount of provisional sums to be included. I advised the client that provisional sums have to be included because of the age of the surveys and that once surveys are done; higher price certainty is possible. In the Royal Wharf Primary School project, the structural drawings incorporated in RIBA Stage 4 did not account for geotechnical surveys for the project site (site surveys were not yet fully completed) but accounted for the site conditions of the surrounding structures to the site. I advised the client that this approach carried risk; as site surveys might show that the soil condition is poor which would result in change orders when the project commences. I also advised the client that further structural design development was required. The time was of the essence for the client, so they decided to go to tender with this set of drawings while bearing the potential risks. Surveys showed that the soil bearing capacity was less than that designed for. I was involved in design workshops where I liaised with the Design team to advise on the commercial impact of the change in the design of the foundation (raft vs. pad foundation). I advised the client of the difference (circa £60k) and advised that this change should be allocated to employer change risks.\n"}
{"text":"<human> I want to write about Competency: Risk management\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Risk management competency is 2.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience: During my university studies, I have studied the different types of risk matrices and how a rating could be calculated by knowing the probability and the impact. I have an understanding of the different categories of risk mentioned under the NRM and, I am aware of the cons of using fixed percentages for the risk events where they are calculated based on the probability and impact. I am aware of the importance of the existence of a risk register which requires to be updated regularly to match the actual condition of the project. Working at Mott MacDonald allowed me to expand on the importance of assigning risks to owners and update the status of the risk based on the action taken by the owner.\n"}
{"text":"<human> I want to write about Competency: Risk management\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Risk management competency is 2.\n<human> Okay, you could help me with level 2.\n<bot> Sure, here is a proposed response: Level: 2  Summary of Experience: In the City of London Freemen's School Main House Refurbishment project, following a number of risk workshops, I prepared a risk register taking into account the risk categories highlighted in NRM1. The risk consequence, probability, impact, and mitigation measures were regularly updated following the discussions in the workshops. I priced the risk items using historical projects and I adjusted the risk monies every month following the monthly team risk review. I was also responsible for circulating the monthly updated risk register with the client, the contractor, and the design team. These risk registers highlight the top 5 risks and the proposed means of mitigation. I created a declining risk cashflow emanating from the need to provide more value to the Client. This cash flow monitored the expenditure of risk monies against every change order raised in the project. On a monthly basis, I advised the client on how much surplus risk could be released into the project.\n"}
{"text":"<human> I want to write about Competency: Contract administration\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Contract administration competency is 2.\n<human> Okay, you could help me with level 1.\n<bot> Sure, here is a proposed response: Level: 1  Summary of Experience: From my studies and work experience with the JCT Standard Building Contract, I am aware of the role of the Contract Administrator. The duties of the Contract Administrator include the change control procedures and the completion procedures. I am also aware that the tasks of the Contract Administrator extend to the preparation of tender documents, seeking instructions from the client for issues relating to the contract, issuing certificates (i.e. interim payment certificate, Payless notice, practical completion, making good the defects).\n"}
{"text":"<human> I want to write about Competency: Contract administration\n<bot> Sure I can help with that. What level are you seeking?\n<human> How many levels are there in this competency?\n<bot> Based on the information that I have, the latest level for this Competency: Contract administration competency is 2.\n<human> Okay, you could help me with level 2.\n<bot> Sure, here is a proposed response: Level: 2  Summary of Experience: In Mott MacDonald, there is a specific change control process where the changes have to be approved by the relevant personnel before issuing the formal instructions. This process has allowed me to advise the contract administrator that the change orders costs have been substantiated and that it is their turn to instruct the variation with the agreed figure. Subject to the agreement of the fees and the scope of services with the Client, I was sometimes required to compile the JCT contract documentation. On the London Borough of Enfield Exeter Road Phase 1 project, I had to obtain confirmation from the client about the required Contract Amendments.  I assisted the London Borough of Wandsworth council with the calculation of Liquidated Damages for the Northcote Library Project. When the client exceeded the proposed figure of Liquidated Damages calculation, we advised the client to reduce the figure to an acceptable limit to be easily agreed with the Contractor. I regularly undertook monthly valuations for projects. The majority of the projects that I worked on used the JCT SBC form of contract. This required me to work closely with the Contract Administrator to issue the relevant interim payment notice within 5 working days.\n"}